Revit 2026 API

# ScheduleFieldSetFormatOptions Method

---

Sets the FormatOptions to optionally override the default settings in the Units class.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFormatOptions(
	FormatOptions formatOptions
)
```
```vb
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
```
```cpp
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
```
```fsharp
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
```

#### Parameters

formatOptions FormatOptions
     The FormatOptions.

| Exception | Condition |
| --- | --- |
| ArgumentException | The display unit in formatOptions is not a valid display unit for the unit type of this ScheduleField, or the rounding method in formatOptions is not set to Nearest. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod. |
| ArgumentNullException | A non-optional argument was null |

See the UnitType property to determine the unit type of this field.

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace